#ifndef COUNTER_H_
#define COUNTER_H_
#include "stdint.h"
/*
**	##################################################################################
**	Counter0_Init()初始化一个计数器，初始化以后就可以使用了,使用引脚为PTC5   方向b18
**	Counter0_Read()返回计数器的值
**	Counter0_Clear()清零计数器，使其从0开始重新计数
**	!!!!!!!计数器的最大值为65535，要确保在计数器达到65535之前执行清0操作，否则后果自负
**	!!!!!!!该计数器最大限制将在后续版本中进行改进......................
**	##################################################################################
*/
extern void Counter0_Init(void);
extern uint32_t Counter0_Read(void);
extern void Counter0_Clear(void);
/*
**	##################################################################################
**	Counter1_Init()初始化一个计数器，初始化以后就可以使用了,使用引脚为PTC13   方向b10
**	Counter1_Read()返回计数器的值
**	Counter1_Clear()清零计数器，使其从0开始重新计数
**	!!!!!!!计数器的最大值为65535，要确保在计数器达到65535之前执行清0操作，否则后果自负
**	!!!!!!!该计数器最大限制将在后续版本中进行改进......................
**	##################################################################################
*/
extern void Counter1_Init(void);
extern uint32_t Counter1_Read(void);
extern void Counter1_Clear(void);

#endif
