//======================================================================
//isr.c
//此文件是各类中断函数入口，只要将中断任务写入相应的中断函数即可，这里
//仅罗列部分，具体请参照启动文件startup_MKL25Z4.s
//
//======================================================================

#include "isr.h"
#include "adc.h"
#include "pit.h"
#include "led.h"
#include "TPM.h"
//======================================================================
//PIT中断配置函数
//入口：PIT通道：PITx  ，时间间隔：timePIT
//返回：无
//
//======================================================================
void configPIT(uint8_t PITx , uint32_t timePIT)
{
	
	PIT_InitTypeDef PITInit;                  //定义pit配置结构
	PITInit.PITx=PITx;                        //pit通道
	PITInit.PIT_Interval=timePIT;             //pit时间间隔
	PIT_Init(&PITInit);                       //传送设置
	PIT_ITConfig( PITx,PIT_IT_TIF,ENABLE );   //配置中断
//以下部分在初始化后必须运行，若有其他中断可在主函数添加。
//	NVIC_EnableIRQ(PIT_IRQn);                 //开启优先管理
//	PIT_Start(PITx);                          //开启PIT
	
}



//======================================================================
//定时中断事件函数
//入口：无
//返回：无
//
//======================================================================
void PIT_IRQHandler(void)
{
 	ITStatus state;
 	state = PIT_GetITStatus(PIT0, PIT_IT_TIF);
 	if(state == SET)
 	{
		twinkleLed(PTB,0);
 		PIT_ClearITPendingBit(PIT0, PIT_IT_TIF);
 	}
	
}



//======================================================================
//AD中断事件函数
//入口：无
//返回：无
//
//======================================================================
void ADC0_IRQHandler(void)
{

}



//======================================================================
//串口中断事件函数
//入口：无
//返回：无
//
//======================================================================
void UART0_IRQHandler(void)
{
 	
}



void UART1_IRQHandler(void)
{
 	
}



void UART2_IRQHandler(void)
{
 	
}


//======================================================================
//DMA中断事件函数
//入口：无
//返回：无
//
//======================================================================
void DMA0_IRQHandler(void)
{
	
}




void DMA1_IRQHandler(void)
{
	
}




void DMA2_IRQHandler(void)
{
	
}




void DMA3_IRQHandler(void)
{
	
}



//======================================================================
//i2c中断事件函数
//入口：无
//返回：无
//
//======================================================================
void I2C0_IRQHandler(void)
{
	
}


void I2C1_IRQHandler(void)
{
	
}


//======================================================================
//SPI中断事件函数
//入口：无
//返回：无
//
//======================================================================
void SPI0_IRQHandler(void)
{
	
}


void SPI1_IRQHandler(void)
{
	
}



//======================================================================
//外部中断事件函数
//入口：无
//返回：无
//
//======================================================================
void PORTA_IRQHandler(void)
{
	
}


void PORTD_IRQHandler(void)
{
	
}

